In [1]:
import pandas as pd

In [17]:
customers=pd.read_csv(r"C:\Users\Vaishnavi\Downloads\restaurant_customers.csv")

In [18]:
customers

,ID,First Name,Last Name,Gender,Company,Occupation
0,1,Joseph,Perkins,Male,Dynazzy,Community Outreach Specialist
1,2,Jennifer,Alvarez,Female,DabZ,Senior Quality Engineer
2,3,Roger,Black,Male,Tagfeed,Account Executive
3,4,Steven,Evans,Male,Fatz,Registered Nurse
4,5,Judy,Morrison,Female,Demivee,Legal Assistant
...,...,...,...,...,...,...
995,996,Debra,Garcia,Female,Dazzlesphere,Structural Engineer
996,997,Douglas,Bishop,Male,Livepath,Developer I
997,998,Frank,Franklin,Male,Brainverse,Nurse Practicioner
998,999,Jessica,Burns,Female,Babbleblab,Financial Advisor
999,1000,Brian,Daniels,Male,Tazzy,Physical Therapy Assistant

In [6]:
foods=pd.read_csv(r"C:\Users\Vaishnavi\Downloads\restaurant_foods.csv")

In [7]:
foods

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49
5        6       Pasta  13.99
6        7       Steak  24.99
7        8       Salad  11.25
8        9       Donut   0.99
9       10       Drink   1.75

In [5]:
week1=pd.read_csv(r"C:\Users\Vaishnavi\Downloads\restaurant_week_1_sales.csv")

In [6]:
week1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [9]:
week2=pd.read_csv(r"C:\Users\Vaishnavi\Downloads\restaurant_week_2_sales.csv")

In [10]:
week2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [15]:
week1.merge(foods,how="left",on="Food ID")

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

In [19]:
week2.merge(customers,how="right",left_on="Customer ID", right_on="ID")
week2.merge(customers,how="right",left_on="Customer ID", right_on="ID").drop("ID", axis="columns")

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,NaN,NaN,Joseph,Perkins,Male,Dynazzy,Community Outreach Specialist
1,NaN,NaN,Jennifer,Alvarez,Female,DabZ,Senior Quality Engineer
2,NaN,NaN,Roger,Black,Male,Tagfeed,Account Executive
3,NaN,NaN,Steven,Evans,Male,Fatz,Registered Nurse
4,NaN,NaN,Judy,Morrison,Female,Demivee,Legal Assistant
...,...,...,...,...,...,...,...
1021,996.0,10.0,Debra,Garcia,Female,Dazzlesphere,Structural Engineer
1022,NaN,NaN,Douglas,Bishop,Male,Livepath,Developer I
1023,NaN,NaN,Frank,Franklin,Male,Brainverse,Nurse Practicioner
1024,NaN,NaN,Jessica,Burns,Female,Babbleblab,Financial Advisor
1025,NaN,NaN,Brian,Daniels,Male,Tazzy,Physical Therapy Assistant

In [20]:
week1[week1["Customer ID"]==155]

    Customer ID  Food ID
4           155        9
17          155        1

In [21]:
week2[week2["Customer ID"]==155]

     Customer ID  Food ID
208          155        3

In [25]:
week1.merge(week2, how="inner", on="Customer ID", suffixes=[" - week1"," - week 2"])

    Customer ID  Food ID - week1  Food ID - week 2
0           537                9                 5
1           155                9                 3
2           503                5                 8
3           503                5                 9
4           155                1                 3
..          ...              ...               ...
57          945                5                 4
58          343                3                 5
59          343                3                 2
60          343                3                 7
61          621                9                 6

[62 rows x 3 columns]

In [29]:
condition_one=week1["Customer ID"]==155
condition_two= week1["Food ID"]=201
week1[condition_one & condition_two]

    Customer ID  Food ID
4           155      201
17          155      201

In [30]:
condition_one=week1["Customer ID"]==578
condition_two= week1["Food ID"]=5
week1[condition_one & condition_two]

     Customer ID  Food ID
224          578        5

In [26]:
week1.merge(week2, how="outer", on="Customer ID", suffixes=[" - week1"," - week 2"])

     Customer ID  Food ID - week1  Food ID - week 2
0              3              2.0               NaN
1              8              NaN               6.0
2             10              2.0               NaN
3             13              NaN               2.0
4             20              1.0               NaN
..           ...              ...               ...
449          985              5.0               NaN
450          991              2.0               NaN
451          994              NaN               2.0
452          996              NaN              10.0
453         1000              2.0               NaN

[454 rows x 3 columns]

In [29]:
merged=week1.merge(week2, how="outer", on="Customer ID", suffixes=[" - Week 1" , " - Week 2"],indicator=True)
merged["_merge"].value_counts()

merged[merged["_merge"].isin(["left_only","right_only"])]

     Customer ID  Food ID - Week 1  Food ID - Week 2      _merge
0              3               2.0               NaN   left_only
1              8               NaN               6.0  right_only
2             10               2.0               NaN   left_only
3             13               NaN               2.0  right_only
4             20               1.0               NaN   left_only
..           ...               ...               ...         ...
449          985               5.0               NaN   left_only
450          991               2.0               NaN   left_only
451          994               NaN               2.0  right_only
452          996               NaN              10.0  right_only
453         1000               2.0               NaN   left_only

[392 rows x 4 columns]

In [32]:
customers=pd.read_csv(r"C:\Users\Vaishnavi\Downloads\restaurant_customers.csv", index_col="ID")
foods=pd.read_csv(r"C:\Users\Vaishnavi\Downloads\restaurant_foods.csv", index_col="Food ID")

In [33]:
customers

     First Name Last Name  Gender       Company                     Occupation
ID
1        Joseph   Perkins    Male       Dynazzy  Community Outreach Specialist
2      Jennifer   Alvarez  Female          DabZ        Senior Quality Engineer
3         Roger     Black    Male       Tagfeed              Account Executive
4        Steven     Evans    Male          Fatz               Registered Nurse
5          Judy  Morrison  Female       Demivee                Legal Assistant
...         ...       ...     ...           ...                            ...
996       Debra    Garcia  Female  Dazzlesphere            Structural Engineer
997     Douglas    Bishop    Male      Livepath                    Developer I
998       Frank  Franklin    Male    Brainverse             Nurse Practicioner
999     Jessica     Burns  Female    Babbleblab              Financial Advisor
1000      Brian   Daniels    Male         Tazzy     Physical Therapy Assistant

[1000 rows x 5 columns]

In [34]:
foods

          Food Item  Price
Food ID
1             Sushi   3.99
2           Burrito   9.99
3              Taco   2.99
4        Quesadilla   4.25
5             Pizza   2.49
6             Pasta  13.99
7             Steak  24.99
8             Salad  11.25
9             Donut   0.99
10            Drink   1.75

In [36]:
week1.merge(customers, how="left", left_on="Customer ID", right_index=True).merge(foods, how="left" , left_on="Food ID", right_index=True)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III,Burrito,9.99
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III,Donut,0.99
...,...,...,...,...,...,...,...,...,...
245,413,9,Diane,Bailey,Female,Wikibox,Technical Writer,Donut,0.99
246,926,6,Anne,Wagner,Female,Skyba,Legal Assistant,Pasta,13.99
247,134,3,Diana,Hall,Female,Quinu,Financial Advisor,Taco,2.99
248,396,6,Juan,Romero,Male,Zoonder,Analyst Programmer,Pasta,13.99
249,535,10,Nancy,Cox,Female,Trudeo,Research Associate,Drink,1.75